---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SweepFailures.SweepFailedError
source: html/b0b3b965-e235-27cd-7804-3e45048dad5a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SweepFailures.SweepFailedError Property

Proper sweep geometry creation failed.

## Syntax (C#)
```csharp
public static FailureDefinitionId SweepFailedError { get; }
```